tutorials/openfoam_tutorials/les/pitzDaily/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
12225
(
(-6317.77 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
30
(
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
(-12635.5 0 0 0 0 0 0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    upperWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
223
(
(-6317.77 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    lowerWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
250
(
(-6317.77 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
